Repository: bilalsul/rzv
Catalog: lib/l10n/app_*.arb
Languages: ar, es, ru

# appAboutTitle
source: About Repo Zip Viewer
ar: عن Repo Zip Viewer
es: Acerca de Repo Zip Viewer
ru: О Repo Zip Viewer

# appAbout
source: Extract .zip git codebases and view files in markdown and read-only mode code editor.
ar: فك ضغط قواعد الكود من git بصيغة .zip وعرض الملفات كـ Markdown وفي محرر أكواد بوضع القراءة فقط.
es: Extrae codebases git en formato .zip y visualiza archivos en markdown y en editor de código en modo solo lectura.
ru: Распаковывает .zip-архивы с git-кодовой базой и позволяет просматривать файлы в формате markdown и в редакторе кода в режиме только чтение.

# appVersion
source: Version
ar: الإصدار
es: Versión
ru: Версия

# appChangelog
source: Changelog
ar: سجل التغييرات

# appLicense
source: License
ar: الترخيص
es: Licencia
ru: Лицензия

# appAuthor
source: Author
ar: المؤلف
es: Autor
ru: Автор

# appDonate
source: Donate
ar: تبرع
es: Donar
ru: Поддержать

# appDonateTips
source: Repo Zip Viewer is an open-source software that is free to use. If you find it helpful, please donate to support us to continue improving it.
ar: مستكشف Git هو برنامج مفتوح المصدر مجاني الاستخدام. إذا وجدته مفيدًا، يرجى التبرع لدعمنا لمواصلة تحسينه.
es: Repo Zip Viewer es un software de código abierto y gratuito. Si te resulta útil, por favor dona para apoyarnos a seguir mejorándolo.
ru: Repo Zip Viewer — это бесплатное программное обеспечение с открытым исходным кодом. Если оно вам полезно, пожалуйста, поддержите нас донатом — это поможет продолжать развитие.

# appPrivacyPolicy
source: Privacy Policy
ar: سياسة الخصوصية
es: Política de privacidad
ru: Политика конфиденциальности

# appTerms
source: Terms of Use
ar: شروط الاستخدام
es: Términos de uso
ru: Условия использования

# onboardingWelcomeTitle
source: Repo Zip Viewer - git Browser
ar: Repo Zip Viewer - متصفح git
es: Repo Zip Viewer - Navegador git
ru: Repo Zip Viewer - браузер git

# onboardingWelcomeBody
source: Browse git repositories offline by importing .zip files. View in code editor and markdown renderer in read-only mode. Perfect for learning, reviewing, or exploring git projects on the go quickly without setting up git.
ar: تصفح مستودعات git دون اتصال بالإنترنت عبر استيراد ملفات .zip. عرض في محرر الكود ومُقدم markdown في وضع القراءة فقط. مثالي للتعلم أو المراجعة أو استكشاف مشاريع git أثناء التنقل بسرعة دون إعداد git.
es: Explora repositorios git sin conexión importando archivos .zip. Visualiza en el editor de código y renderizador markdown en modo solo lectura. Perfecto para aprender, revisar o explorar proyectos git rápidamente en movimiento sin configurar git.
ru: Просматривайте git-репозитории оффлайн, импортируя .zip-файлы. Просматривайте в редакторе кода и рендере markdown в режиме только чтение. Идеально для обучения, проверки или исследования git-проектов на ходу быстро без настройки git.

# onboardingAppearanceTitle
source: Choose Your Look
ar: اختر مظهرك
es: Elige tu apariencia
ru: Выберите свой вид

# onboardingAppearanceBody
source: Select a theme that suits your style and device. Repo Zip Viewer supports light, dark, and specialized modes for the best reading experience.
ar: اختر موضوعًا يناسب أسلوبك وجهازك. يدعم Repo Zip Viewer أوضاع فاتحة وداكنة ومتخصصة لأفضل تجربة قراءة.
es: Selecciona un tema que se adapte a tu estilo y dispositivo. Repo Zip Viewer soporta modos claros, oscuros y especializados para la mejor experiencia de lectura.
ru: Выберите тему, подходящую вашему стилю и устройству. Repo Zip Viewer поддерживает светлые, темные и специальные режимы для лучшего опыта чтения.

# onboardingAppearanceTip
source: You can always change themes later in Settings.
ar: يمكنك دائمًا تغيير الثيمات لاحقًا في الإعدادات.
es: Siempre puedes cambiar los temas más tarde en Ajustes.
ru: Вы всегда можете изменить темы позже в Настройках.

source: Customize Your Experience
ar: خصص تجربتك
es: Personaliza tu experiencia
ru: Настройте свой опыт

source: e-Ink Mode
ar: وضع e-Ink
es: Modo e-Ink
ru: Режим e-Ink

# optimizedForEInkDisplays
source: Optimized for e-Ink displays with high contrast and minimal animations for comfortable long reading sessions.
ar: محسن لشاشات e-Ink مع تباين عالي وأقل حركات لجلسات قراءة مريحة طويلة.
es: Optimizado para pantallas e-Ink con alto contraste y animaciones mínimas para sesiones de lectura cómodas y largas.
ru: Оптимизировано для e-Ink-дисплеев с высоким контрастом и минимальными анимациями для комфортных длинных сессий чтения.

# moreDisplayOptionsTip
source: Enable Theme Customizer for more display options in Settings.
ar: فعل مخصص الثيمات لمزيد من خيارات العرض في الإعدادات.
es: Habilita el Personalizador de Temas para más opciones de visualización en Ajustes.
ru: Включите Настройщик Тем для большего количества опций отображения в Настройках.

# onboardingPluginsTitle
source: Dedicated Plugins Manager
ar: مدير إضافات مخصص
es: Gestor de Plugins Dedicado
ru: Выделенный Менеджер Плагинов

# onboardingPluginsBody
source: Extend functionality with built-in plugins. Enable features like Editor Options, Theme Customizer, and more to match your workflow.
ar: وسع الوظائف بإضافات مدمجة. فعل ميزات مثل خيارات المحرر، مخصص الثيمات وغيرها لتناسب تدفق عملك.
es: Extiende la funcionalidad con plugins integrados. Habilita características como Opciones del Editor, Personalizador de Temas y más para adaptarte a tu flujo de trabajo.
ru: Расширьте функциональность встроенными плагинами. Включите функции вроде Опций Редактора, Настройщика Тем и больше для соответствия вашему рабочему процессу.

# onboardingPluginsTip
source: Toggle plugins anytime from the Plugins Manager by swipping left.
ar: فعل/تعطيل الإضافات في أي وقت من مدير الإضافات بسحب إلى اليسار.
es: Activa/desactiva plugins en cualquier momento desde el Gestor de Plugins deslizando a la izquierda.
ru: Включайте/выключайте плагины в любое время из Менеджера Плагинов, свайпнув влево.

# onboardingEditorTitle
source: Customizable Code Editor
ar: محرر كود قابل للتخصيص
es: Editor de Código Personalizable
ru: Настраиваемый Редактор Кода

# onboardingEditorBody
source: Enjoy syntax highlighting, customizable font size, zoom in/out, and view unsupported characters if available and more in a read-only editor designed for code viewing.
ar: استمتع بتسليط الضوء على الصياغة، أحجام خطوط قابلة للتخصيص، تكبير/تصغير، وعرض الأحرف غير المدعومة إذا كانت متاحة وأكثر في محرر قراءة فقط مصمم لعرض الكود.
es: Disfruta de resaltado de sintaxis, tamaños de fuente personalizables, zoom in/out y visualiza caracteres no compatibles si están disponibles y más en un editor de solo lectura diseñado para ver código.
ru: Наслаждайтесь подсветкой синтаксиса, настраиваемыми размерами шрифта, зумом in/out и просмотром неподдерживаемых символов если доступны и больше в редакторе только для чтения, предназначенном для просмотра кода.

# onboardingEditorTip
source: Fine-tune code editor settings by enabling Advanced Editor Options in Plugins Manager.
ar: ضبط إعدادات محرر الكود بدقة بتفعيل خيارات المحرر المتقدمة في مدير الإضافات.
es: Ajusta las configuraciones del editor de código habilitando Opciones Avanzadas del Editor en el Gestor de Plugins.
ru: Тонкая настройка настроек редактора кода путем включения Расширенных Опций Редактора в Менеджере Плагинов.

# onboardingCompleteTitle
source: You're All Set!
ar: أنت جاهز!
es: ¡Estás listo!
ru: Вы готовы!

# onboardingCompleteBody
source: Start exploring git projects offline. Import your first .zip git project after downloading the ZIP from GitHub, GitLab or BitBucket and more.
ar: ابدأ في استكشاف مشاريع git دون اتصال. استورد أول مشروع git .zip بعد تنزيل الـ ZIP من GitHub أو GitLab أو BitBucket وغيرها.
es: Comienza a explorar proyectos git sin conexión. Importa tu primer proyecto git .zip después de descargar el ZIP desde GitHub, GitLab o BitBucket y más.
ru: Начните исследовать git-проекты оффлайн. Импортируйте свой первый .zip git-проект после скачивания ZIP с GitHub, GitLab или BitBucket и больше.

# commonUpdated
source: Updated!
ar: تم التحديث!
es: ¡Actualizado!
ru: Обновлено!

source: What's New
ar: ما الجديد
es: Novedades
ru: Что нового

# updateFromVersion
source: Updated from {version}
ar: تم التحديث من {version}
es: Actualizado desde {version}
ru: Обновлено с {version}

source: Welcome to {version}
ar: مرحبا بك في {version}
es: Bienvenido a {version}
ru: Добро пожаловать в {version}

# aboutCheckForUpdates
source: Check for updates
ar: التحقق من التحديثات
es: Buscar actualizaciones
ru: Проверить обновления

# updateNewVersion
source: New version:
ar: إصدار جديد:
es: Nueva versión:
ru: Новая версия:

# updateCurrentVersion
source: Current version:
ar: الإصدار الحالي:
es: Versión actual:
ru: Текущая версия:

# updateViaGithub
source: Via GitHub
ar: عبر GitHub
es: Vía GitHub
ru: Через GitHub

# updateViaOfficialWebsite
source: Via Website
ar: عبر الموقع
es: Vía Sitio Web
ru: Через Веб-сайт

# commonSkip
source: Skip
ar: تخطي
es: Omitir
ru: Пропустить

# commonDone
source: Done
ar: تم
es: Hecho
ru: Готово

# navBarHome
source: Projects
ar: المشاريع
es: Proyectos
ru: Проекты

# navBarFileExplorer
source: File Explorer
ar: مستكشف الملفات
es: Explorador de Archivos
ru: Проводник

# navBarEditor
source: Editor
ar: المحرر
ru: Редактор

# navBarAI
source: AI
ar: الذكاء الاصطناعي
es: IA
ru: ИИ

# navBarGitHistory
source: Git History
ar: سجل Git
es: Historial Git
ru: История Git

# navBarTerminal
source: Terminal
ar: الطرفية
ru: Терминал

# navBarSettings
source: Settings
ar: الإعدادات
es: Ajustes
ru: Настройки

# settingsDarkMode
source: Dark
ar: مظلم
es: Oscuro
ru: Тёмная

# settingsLightMode
source: Light
ar: فاتح
es: Claro
ru: Светлая

# settingsSystemMode
source: System
ar: النظام
es: Sistema
ru: Системная

# settingsMoreSettings
source: More Settings
ar: إعدادات إضافية
es: Más ajustes
ru: Дополнительные настройки

# settingsAppearance
source: Appearance
ar: المظهر
es: Apariencia
ru: Внешний вид

# settingsAppearanceTheme
source: Theme
ar: السمة
es: Tema
ru: Тема

# settingsAppearanceThemeColor
source: Theme Color
ar: لون السمة
es: Color del tema
ru: Цвет темы

# settingsAppearanceDisplay
source: Display
ar: العرض
es: Pantalla
ru: Отображение

# settingsAppearanceLanguage
source: Language
ar: اللغة
es: Idioma
ru: Язык

# settingsAppearanceBottomNavigatorShow
source: Bottom Navigator
ar: المستكشف السفلي
es: Barra inferior
ru: Нижняя панель навигации

# settingsAppearancePrimaryColor
source: Primary color
ar: اللون الأساسي
es: Color primario
ru: Основной цвет

# settingsAppearanceSecondaryColor
source: Secondary color
ar: اللون الثانوي
es: Color secundario
ru: Второстепенный цвет

# settingsAppearanceAccentColor
source: Accent color
ar: لون التمييز
es: Color de acento
ru: Акцентный цвет

# settingsRevertThemeColors
source: Revert
ar: تراجع
es: Restaurar
ru: Сбросить

# settingsEditorSettings
source: Editor Settings
ar: إعدادات المحرر
es: Configuración del editor
ru: Настройки редактора

# settingsEditorTabSize
source: Tab size
ar: حجم علامة التبويب
es: Tamaño de tabulación
ru: Размер табуляции

# settingsEditorShowLineNumbers
source: Show line numbers
ar: إظهار أرقام الأسطر
es: Mostrar números de línea
ru: Номера строк

# settingsEditorOpenFilePlaceholder
source: # Open File from a Project to view in Editor
ar: # افتح ملفًا من مشروع لعرضه في المحرر
es: # Abrir archivo de un proyecto para verlo en el Editor
ru: # Открыть файл из проекта для просмотра в редакторе

# settingsEditorFontSize
source: Font Size
ar: حجم الخط
es: Tamaño de fuente
ru: Размер шрифта

# settingsEditorFontFamily
source: Font Family
ar: عائلة الخط
es: Familia de fuentes
ru: Семейство шрифтов

# settingsEditorZoomInOut
source: Enable Zoom In/Out
ar: تفعيل التكبير/التصغير
es: Habilitar Zoom In/Out
ru: Включить масштабирование (In/Out)

# settingsEditorRenderUnsupportedCharacters
source: View Unsupported Characters with Warning ðŸ””
ar: عرض الأحرف غير المدعومة مع تحذير 🔔
es: Mostrar caracteres no admitidos con advertencia 🔔
ru: Отображать неподдерживаемые символы с предупреждением 🔔

# settingsAiSettings
source: AI Settings
ar: إعدادات الذكاء الاصطناعي
es: Configuración de IA
ru: Настройки ИИ

# settingsAiModelProvider
source: Model provider
ar: مزود النموذج
es: Proveedor de modelo
ru: Провайдер модели

# settingsAiMaxTokens
source: Max tokens
ar: الحد الأقصى للرموز
es: Máx. tokens
ru: Максимум токенов

# settingsApiKeySecure
source: API Key (secure)
ar: مفتاح API (آمن)
es: Clave API (segura)
ru: Ключ API (защищён)

# settingsApplyAiSettings
source: Apply AI settings
ar: تطبيق إعدادات الذكاء الاصطناعي
es: Aplicar ajustes de IA
ru: Применить настройки ИИ

# settingsConfigure
source: Configure
ar: إعداد
es: Configurar
ru: Настроить

# settingsConfigureProvider
source: Configure {provider}
ar: إعداد {provider}
es: Configurar {provider}
ru: Настроить {provider}

# settingsProviderSaved
source: {provider} settings saved
ar: تم حفظ إعدادات {provider}
es: Configuración de {provider} guardada
ru: Настройки {provider} сохранены

# settingsResetAiSettings
source: Reset AI settings
ar: إعادة تعيين إعدادات الذكاء الاصطناعي
es: Restablecer configuración de IA
ru: Сбросить настройки ИИ

# settingsResetAiConfirm
source: Are you sure you want to delete AI URLs and API keys permanently?
ar: هل أنت متأكد أنك تريد حذف روابط الذكاء الاصطناعي ومفاتيح API نهائياً؟
es: ¿Estás seguro de que deseas eliminar permanentemente las URLs de IA y las claves API?
ru: Вы уверены, что хотите навсегда удалить URL и ключи API ИИ?

# settingsAiSettingsReset
source: AI settings reset
ar: تم إعادة تعيين إعدادات الذكاء الاصطناعي
es: Configuración de IA restablecida
ru: Настройки ИИ сброшены

# settingsModelLabel
source: Model
ar: النموذج
es: Modelo
ru: Модель

# settingsApiUrlOptional
source: API URL (optional)
ar: رابط API (اختياري)
es: URL de la API (opcional)
ru: URL API (необязательно)

# settingsApiKey
source: API Key
ar: مفتاح API
es: Clave API
ru: Ключ API

# settingsApiKeySet
source: Key is set
ar: تم تعيين المفتاح
es: Clave establecida
ru: Ключ установлен

# settingsApiKeyNotSet
source: No key set
ar: لم يتم تعيين مفتاح
es: Ninguna clave establecida
ru: Ключ не задан

# settingsSetApiKey
source: Set API Key
ar: تعيين مفتاح API
es: Establecer clave API
ru: Задать ключ API

source: Connection failed
ar: فشل الاتصال
es: Conexión fallida
ru: Соединение не удалось

source: Connection successful
ar: تم الاتصال بنجاح
es: Conexión exitosa
ru: Соединение установлено

# settingsFileExplorerSettings
source: File Explorer Settings
ar: إعدادات مستكشف الملفات
es: Configuración del explorador de archivos
ru: Настройки проводника

# settingsFileExplorerShowHidden
source: Show hidden files
ar: إظهار الملفات المخفية
es: Mostrar archivos ocultos
ru: Показывать скрытые файлы

# settingsFileExplorerPreviewMarkdown
source: Preview markdown files
ar: معاينة ملفات markdown
es: Vista previa de Markdown
ru: Предпросмотр Markdown

# settingsResetPluginDefaults
source: Reset plugin settings to defaults
ar: إعادة تعيين إعدادات الإضافات
es: Restablecer ajustes del plugin
ru: Сбросить настройки плагинов

# settingsThemeApplied
source: Theme colors applied
ar: تم تطبيق ألوان السمة
es: Colores del tema aplicados
ru: Цвета темы применены

# commonDelete
source: Delete
ar: حذف
es: Eliminar
ru: Удалить

# commonCreate
source: Create
ar: إنشاء
es: Crear
ru: Создать

# commonCopied
source: Copied
ar: تم النسخ
es: Copiado
ru: Скопировано

# commonSave
source: Save
ar: حفظ
es: Guardar
ru: Сохранить

# commonRefresh
source: Refresh
ar: تحديث
es: Actualizar
ru: Обновить

# commonCancel
source: Cancel
ar: إلغاء
es: Cancelar
ru: Отмена

# commonOk
source: OK
ar: موافق
es: Aceptar
ru: ОК

# commonSuccess
source: Success
ar: نجح
es: Éxito
ru: Успешно

# commonFailed
source: Failed
ar: فشل
es: Fallido
ru: Ошибка

# commonUploading
source: Uploading
ar: جاري الرفع
es: Subiendo
ru: Загрузка

# commonDownloading
source: Downloading
ar: جاري التحميل
es: Descargando
ru: Скачивание

# commonCopy
source: Copy
ar: نسخ
es: Copiar
ru: Копировать

# commonNewVersion
source: New version!
ar: إصدار جديد!
es: ¡Nueva versión!
ru: Новая версия!

# commonUpdate
source: Update
ar: تحديث
es: Actualizar
ru: Обновить

# commonNoNewVersion
source: No new version
ar: لا يوجد إصدار جديد
es: Sin nueva versión
ru: Обновлений нет

# commonConfirm
source: Confirm
ar: تأكيد
es: Confirmar
ru: Подтвердить

# commonCanceled
source: Canceled
ar: تم الإلغاء
es: Cancelado
ru: Отменено

# commonAttention
source: Attention
ar: انتباه
es: Atención
ru: Внимание

# commonSaving
source: Saving
ar: جاري الحفظ
es: Guardando
ru: Сохранение

# commonSaved
source: Saved
ar: تم الحفظ
es: Guardado
ru: Сохранено

# commonTest
source: Test
ar: اختبار
es: Probar
ru: Тест

# commonDissolve
source: Dissolve
ar: حل
es: Disolver
ru: Разделить

# commonEdit
source: Edit
ar: تعديل
es: Editar
ru: Изменить

# commonApply
source: Apply
ar: تطبيق
es: Aplicar
ru: Применить

# commonReset
source: Reset
ar: إعادة تعيين
es: Restablecer
ru: Сбросить

# commonNone
source: None
ar: لا شيء
es: Ninguno
ru: Нет

# commonError
source: Error
ar: خطأ
ru: Ошибка

# commonUndo
source: Undo
ar: تراجع
es: Deshacer
ru: Отменить

# commonResume
source: Resume
ar: متابعة
es: Reanudar
ru: Продолжить

# commonRetry
source: Retry
ar: إعادة المحاولة
es: Reintentar
ru: Повторить

# commonDisabled
source: Disabled
ar: معطل
es: Deshabilitado
ru: Отключено

# commonNotSupported
source: Not Supported
ar: غير مدعوم
es: No soportado
ru: Не поддерживается

# featureNotSupported
source: Feature Not Supported At The Moment. Check Future Releases
ar: الميزة غير مدعومة في الوقت الحالي. تحقق من الإصدارات المستقبلية
es: Función no soportada en este momento. Revisa las próximas versiones
ru: Функция пока не поддерживается. Следите за будущими релизами

# enableFeatureFromPlugins
source: Enable this feature from the Plugins
ar: فعّل هذه الميزة من الإضافات
es: Habilita esta función desde los Plugins
ru: Включите эту функцию в разделе Плагины

# homeProjectsTitle
source: Imported/Created Projects
ar: المشاريع المستوردة/المنشأة
es: Proyectos Importados/Creados
ru: Импортированные/созданные проекты

# homeGitProjectsTitle
source: Imported git Projects
ar: مشاريع git المستوردة
es: Proyectos git importados
ru: Импортированные git-проекты

# homeDefaultProjectName
source: Project
ar: مشروع
es: Proyecto
ru: Проект

# homeNoProjects
source: No projects yet
ar: لا توجد مشاريع بعد
es: Aún no hay proyectos
ru: Проектов пока нет

# homeGetStarted
source: Create or import a project to get started
ar: أنشئ أو استورد مشروعًا للبدء
es: Crea o importa un proyecto para comenzar
ru: Создайте или импортируйте проект, чтобы начать

# homeImportGetStarted
source: Import a .zip file project to get started
ar: استورد مشروعًا بصيغة .zip للبدء
es: Importa un proyecto .zip para comenzar
ru: Импортируйте проект в формате .zip, чтобы начать

# homeCreateProject
source: Create Project
ar: إنشاء مشروع
es: Crear Proyectos
ru: Создать проект

# homeImportProject
source: Import Project
ar: استيراد مشروع
es: Importar Proyectos
ru: Импортировать проект

# homeDeleteProjectConfirm
source: Delete project?
ar: حذف المشروع؟
es: ¿Eliminar proyecto?
ru: Удалить проект?

# homeDeleteProjectDialogContent
source: Delete project and all files permanently? This cannot be undone.
ar: حذف المشروع وجميع الملفات نهائيًا؟ لا يمكن التراجع عن هذا الإجراء.
es: ¿Eliminar el proyecto y todos los archivos permanentemente? Esta acción no se puede deshacer.
ru: Удалить проект и все файлы навсегда? Это действие нельзя отменить.

# homeDeleteAllProjects
source: Delete All Projects
ar: حذف جميع المشاريع
es: Eliminar todos los proyectos
ru: Удалить все проекты

# homeRefreshProjects
source: Refresh Projects
ar: تحديث المشاريع
es: Actualizar proyectos
ru: Обновить проекты

# homeRefreshProjectsPrompt
source: This might take longer if you have extremely large projects. Click Refresh to Continue
ar: قد يستغرق الأمر وقتًا أطول إذا كانت لديك مشاريع كبيرة جدًا. انقر على تحديث للمتابعة
es: Esto podría tardar más si tienes proyectos extremadamente grandes. Haz clic en Actualizar para continuar
ru: Это может занять больше времени, если у вас есть чрезвычайно большие проекты. Нажмите Обновить, чтобы продолжить

# homeRefreshedProjects
source: Projects refreshed
ar: تم تحديث المشاريع
es: Proyectos actualizados
ru: Проекты обновлены

# homeRefreshProjectsFailed
source: Failed to refresh projects
ar: فشل تحديث المشاريع
es: Error al actualizar proyectos
ru: Не удалось обновить проекты

# homeDeleteAllProjectsPrompt
source: You are going to delete ALL projects. This action cannot be undone. Do you want to proceed?
ar: أنت على وشك حذف جميع المشاريع. هذا الإجراء لا يمكن التراجع عنه. هل تريد المتابعة؟
es: Vas a eliminar TODOS los proyectos. Esta acción no se puede deshacer. ¿Deseas continuar?
ru: Вы собираетесь удалить ВСЕ проекты. Это действие нельзя отменить. Продолжить?

# homeDeletedAllProjects
source: All projects deleted
ar: تم حذف جميع المشاريع
es: Todos los proyectos eliminados
ru: Все проекты удалены

# homeDeleteAllProjectsFailed
source: Failed to delete projects
ar: فشل حذف المشاريع
es: Error al eliminar proyectos
ru: Не удалось удалить проекты

# homeUnknown
source: Unknown
ar: غير معروف
es: Desconocido
ru: Неизвестно

# homeModified
source: Modified
ar: تم التعديل
es: Modificado
ru: Изменён

# homeFiles
source: Files
ar: الملفات
es: Archivos
ru: Файлы

# homeFolders
source: Folders
ar: المجلدات
es: Carpetas
ru: Папки

# homeReadmeNotFound
source: No README found
ar: لم يتم العثور على README
es: No se encontró README
ru: README не найден

# homeOpenFileEditorNotice
source: This file will open in editor later
ar: سيتم فتح هذا الملف في المحرر لاحقًا
es: Este archivo se abrirá en el editor más tarde
ru: Файл будет открыт в редакторе позже

# homeBack
source: Back
ar: رجوع
es: Volver
ru: Назад

# homeAddProjectName
source: Project Name
ar: اسم المشروع
es: Nombre del Proyecto
ru: Название проекта

# homeCreatedNewProject
source: Project Created
ar: تم إنشاء المشروع
es: Proyecto Creado
ru: Проект создан

# homeImportZipProject
source: Import project (zip)
ar: استيراد مشروع (zip)
es: Importar proyecto (zip)
ru: Импорт проекта (zip)

# homeImportedZipNotFound
source: Imported Zip file not found
ar: لم يتم العثور على ملف zip المستورد
es: Archivo zip importado no encontrado
ru: Импортированный zip-файл не найден

# homeImportZipAsProject
source: Imported zip as Project
ar: تم استيراد zip كمشروع
es: Zip importado como Proyecto
ru: Zip импортирован как проект

# homeImportFailed
source: Import failed:
ar: فشل الاستيراد:
es: Importación fallida:
ru: Ошибка импорта:

# homeProjectCreatedTemp
source: Project created (temp)
ar: تم إنشاء المشروع (مؤقت)
es: Proyecto creado (temporal)
ru: Проект создан (временный)

# homeProjectImportedTemp
source: Project imported (temp)
ar: تم استيراد المشروع (مؤقت)
es: Proyecto importado (temporal)
ru: Проект импортирован (временный)

# homeProjectRemoved
source: Project removed
ar: تم إزالة المشروع
es: Proyecto eliminado
ru: Проект удалён

# homeSampleZipCreatedAndImported
source: Sample zip created and imported
ar: تم إنشاء واستيراد نموذج zip
es: Archivo zip de ejemplo creado e importado
ru: Пример zip создан и импортирован

# homeTooltipImportTemp
source: Import project (temp)
ar: استيراد مشروع (مؤقت)
es: Importar proyecto (temporal)
ru: Импортировать проект (временный)

# homeTooltipCreateDetails
source: Create project (details)
ar: إنشاء مشروع (تفاصيل)
es: Crear proyecto (detalles)
ru: Создать проект (подробно)

# homeTooltipCreateSampleZip
source: Create & import sample zip
ar: إنشاء واستيراد نموذج zip
es: Crear e importar zip de ejemplo
ru: Создать и импортировать пример zip

# homeOpenMenu
source: Open
ar: فتح
es: Abrir
ru: Открыть

# homeMarkdownFile
source: Markdown file
ar: ملف Markdown
es: Archivo Markdown
ru: Файл Markdown
