Repository: bilalsul/rzv
Catalog: lib/l10n/app_*.arb
Languages: ar, es, ru

# homeFilePreviewUnavailable
source: File preview not available. Open in editor later.
ar: معاينة الملف غير متاحة. افتح في المحرر لاحقًا.
es: Vista previa no disponible. Ábralo en el editor más tarde.
ru: Предпросмотр недоступен. Откройте в редакторе позже.

# homeEmptyDirectory
source: Empty directory
ar: دليل فارغ
es: Directorio vacío
ru: Пустая папка

# homeUnableToDisplayDetails
source: Unable to display details
ar: غير قادر على عرض التفاصيل
es: No se pueden mostrar los detalles
ru: Не удалось показать детали

# homeNoModificationInfo
source: No modification info
ar: لا توجد معلومات تعديل
es: Sin información de modificación
ru: Нет информации об изменениях

# homeSampleImportFailed
source: Sample import failed: {error}
ar: فشل استيراد النموذج: {error}
es: Fallo al importar ejemplo: {error}
ru: Ошибка импорта примера: {error}

# importFailed
source: Import failed: {error}
ar: فشل الاستيراد: {error}
es: Importación fallida: {error}
ru: Ошибка импорта: {error}

# homeExtractImporting
source: Importing project...
ar: جاري استيراد المشروع...
es: Importando proyecto...
ru: Импорт проекта...

# homeExtractStarting
source: Starting extraction...
ar: بدء الاستخراج...
es: Iniciando extracción...
ru: Запуск распаковки...

# homeExtractInitializing
source: initializing...
ar: جاري التهيئة...
es: inicializando...
ru: инициализация...

# homeExtractProgress
source: Extract processing
ar: معالجة الاستخراج
es: Procesando extracción
ru: Обработка распаковки

# homeExtractCurrentFile
source: Current file
ar: الملف الحالي
es: Archivo actual
ru: Текущий файл

# homeExtractItemsExtracted
source: Files extracted
ar: الملفات المستخرجة
es: Archivos extraídos
ru: Распакованные файлы

# homeRetry
source: Retry
ar: إعادة المحاولة
es: Reintentar
ru: Повторить

# tutorialProjectName
source: Tutorial Project
ar: مشروع تعليمي
es: Proyecto Tutorial
ru: Учебный проект

# tutorialProjectReadmeTitle
source: # Welcome to the Repo Zip Viewer Tutorial
ar: # مرحبًا بك في البرنامج التعليمي لمستكشف Git
es: # Bienvenido al tutorial de Repo Zip Viewer
ru: # Добро пожаловать в урок Repo Zip Viewer

# tutorialProjectReadmeBody
source: This README walks you through Projects features and how to open files in read-only mode, no further files modifications. - Tap a project to open it - Tap a markdown file to preview it (make sure it is enabled in File Explorer Settings, disabled by default) or open it in the Editor - Use the PLUGINS & FEATURES section to toggle features like File Explorer - Import .zip file or remove projects from here Enjoy exploring the app! Leave a Review for suggestions
ar: هذا الملف README يرشدك إلى مميزات المشاريع وكيفية فتح الملفات في وضع القراءة فقط دون أي تعديل. - اضغط على مشروع لفتحه - اضغط على ملف markdown لمعاينته (تأكد من تفعيله في إعدادات مستكشف الملفات، معطل افتراضيًا) أو افتحه في المحرر - استخدم قسم PLUGINS & FEATURES لتشغيل/إيقاف ميزات مثل مستكشف الملفات - استورد ملف .zip أو احذف المشاريع من هنا استمتع بالتطبيق! اترك تقييمًا مع اقتراحاتك
es: Este README te guía por las funciones de Proyectos y cómo abrir archivos en modo solo lectura, sin posibilidad de modificación. - Toca un proyecto para abrirlo - Toca un archivo markdown para previsualizarlo (asegúrate de activarlo en Ajustes → Explorador de archivos, desactivado por defecto) o ábrelo en el Editor - Usa la sección PLUGINS & FEATURES para activar/desactivar funciones como el Explorador de archivos - Importa archivos .zip o elimina proyectos desde aquí ¡Disfruta explorando la app! Deja una reseña con tus sugerencias
ru: Этот README познакомит вас с функциями Проектов и покажет, как открывать файлы в режиме только чтение (без изменений). - Нажмите на проект, чтобы открыть его - Нажмите на markdown-файл для предпросмотра (нужно включить в Настройках → Проводник, по умолчанию выключено) или откройте в редакторе - В разделе PLUGINS & FEATURES включайте/выключайте функции, например Проводник файлов - Здесь можно импортировать .zip или удалять проекты Приятного использования! Оставьте отзыв с предложениями

# drawerCurrentProject
source: Current Project
ar: المشروع الحالي
es: Proyecto actual
ru: Текущий проект

# drawerNoProjectOpen
source: No project open
ar: لا يوجد مشروع مفتوح
es: Ningún proyecto abierto
ru: Проект не открыт

# drawerLastOpened
source: Last opened: {time}
ar: آخر فتح: {time}
es: Última apertura: {time}
ru: Последнее открытие: {time}

# drawerNever
source: Never
ar: أبدًا
es: Nunca
ru: Никогда

# drawerPluginsAndFeatures
source: PLUGINS & FEATURES
ar: الإضافات والميزات
es: PLUGINS & FUNCIONES
ru: ПЛАГИНЫ И ФУНКЦИИ

# drawerEditorPlugins
source: Editor Plugins
ar: إضافات المحرر
es: Plugins del editor
ru: Плагины редактора

# drawerGitIntegration
source: Git Integration
ar: تكامل Git
es: Integración Git
ru: Интеграция Git

# drawerUtilityPlugins
source: Utility Plugins
ar: إضافات مساعدة
es: Plugins de utilidad
ru: Утилиты

# drawerExperimental
source: Experimental
ar: تجريبي
ru: Экспериментальное

# drawerBeta
source: BETA
ar: نسخة تجريبية
ru: БЕТА

# drawerFeedback
source: Feedback
ar: ملاحظات
es: Comentarios
ru: Обратная связь

# drawerAbout
source: About
ar: حول
es: Acerca de
ru: О приложении

# drawerPluginId
source: Plugin ID: {id}
ar: معرف الإضافة: {id}
es: ID del plugin: {id}
ru: ID плагина: {id}

# drawerPluginCategory
source: Category: {category}
ar: الفئة: {category}
es: Categoría: {category}
ru: Категория: {category}

# drawerCreateNewFolderTitle
source: Create New Folder
ar: إنشاء مجلد جديد
es: Crear nueva carpeta
ru: Создать новую папку

# drawerFolderNameHint
source: Folder name
ar: اسم المجلد
es: Nombre de la carpeta
ru: Имя папки

# drawerEditorTheme
source: Editor Theme
ar: سمة المحرر
es: Tema del editor
ru: Тема редактора

# drawerEditorWordWrap
source: Word Wrap
ar: التفاف النص
es: Ajuste de línea
ru: Перенос строк

# drawerFeedbackBody
source: We'd love to hear your feedback about Repo Zip Viewer!
ar: نود أن نسمع ملاحظاتك حول Repo Zip Viewer
es: Nos encantaría recibir tus comentarios sobre Repo Zip Viewer!
ru: Мы будем рады вашему отзыву о Repo Zip Viewer!

# drawerSendFeedback
source: Send Feedback
ar: إرسال ملاحظات
es: Enviar comentarios
ru: Отправить отзыв

# drawerFirstInstalled
source: First installed: {date}
ar: أول تثبيت: {date}
es: Primera instalación: {date}
ru: Впервые установлен: {date}

# drawerFeedbackComingSoon
source: Feedback feature coming soon!
ar: ميزة الملاحظات قريبًا!
es: ¡La función de comentarios llegará pronto!
ru: Возможность отправки отзывов появится скоро!

# commonJustNow
source: Just now
ar: الآن
es: Justo ahora
ru: Только что

# commonMinutes
source: {count, plural, other{{count}m ago}}
ar: منذ {count, plural, other{{count} د}}
es: {count, plural, other{hace {count}m}}
ru: {count, plural, one{{count} мин назад} few{{count} мин назад} many{{count} мин назад} other{{count} мин назад}}

# commonHours
source: {count, plural, other{{count}h ago}}
ar: منذ {count, plural, other{{count} س}}
es: {count, plural, other{hace {count}h}}
ru: {count, plural, one{{count} ч назад} few{{count} ч назад} many{{count} ч назад} other{{count} ч назад}}

# commonYesterday
source: Yesterday
ar: أمس
es: Ayer
ru: Вчера

# commonDays
source: {count, plural, other{{count}d ago}}
ar: منذ {count, plural, other{{count} ي}}
es: {count, plural, other{hace {count}d}}
ru: {count, plural, one{{count} день назад} few{{count} дня назад} many{{count} дней назад} other{{count} дней назад}}

# commonClose
source: Close
ar: إغلاق
es: Cerrar
ru: Закрыть

# drawerPluginDetailsPluginId
source: Plugin ID: {id}
ar: معرف الإضافة: {id}
es: ID del plugin: {id}
ru: ID плагина: {id}

# commonDownload
source: Download
ar: تنزيل
es: Descargar
ru: Скачать

# zipManagerDescription
source: Download, Extract and Manage ZIP in one place
ar: تنزيل واستخراج وإدارة ZIP في مكان واحد
es: Descargar, extraer y gestionar ZIP en un solo lugar
ru: Скачивание, извлечение и управление ZIP в одном месте

# zipManagerHeader
source: All in one manager
ar: مدير الكل في واحد
es: Gestor todo en uno
ru: Менеджер все в одном

# zipManagerDownloadZipTitle
source: Download ZIP
ar: تنزيل ZIP
es: Descargar ZIP
ru: Скачать ZIP

# zipManagerDownloadZipHint
source: owner/repo
ar: صاحب/مستودع
es: propietario/repo
ru: владелец/репо

# zipManagerDownloadBranchHint
source: Branch (optional)
ar: الفرع (اختياري)

# zipManagerNoZipsDownloaded
source: No ZIPs downloaded
ar: لم يتم تنزيل أي ZIP
es: No se han descargado ZIP
ru: Нет скачанных ZIP

# zipManagerExtracting
source: Extracting {zip}
ar: جاري استخراج {zip}
es: Extrayendo {zip}
ru: Извлечение {zip}

# zipManagerErrorLoadingZips
source: Error loading ZIPs: {err}
ar: خطأ في تحميل ZIP: {err}
es: Error al cargar ZIP: {err}
ru: Ошибка загрузки ZIP: {err}

# zipManagerMenuExtract
source: Extract ZIP
ar: استخراج ZIP
es: Extraer ZIP
ru: Извлечь ZIP

# zipManagerMenuReextract
source: Re-Extract ZIP
ar: إعادة استخراج ZIP
es: Re-extraer ZIP
ru: Переизвлечь ZIP

# zipManagerMenuDeleteExtracted
source: Delete Extracted
ar: حذف المستخرج
es: Eliminar extraído
ru: Удалить извлеченное

# zipManagerMenuDeleteAllZips
source: Delete all ZIPs?
ar: حذف كل ZIP؟
es: ¿Eliminar todos los ZIP?
ru: Удалить все ZIP?

# zipManagerMenuDeleteAllZipsHint
source: This will delete all downloaded ZIP files.
ar: سيؤدي هذا إلى حذف جميع ملفات ZIP المحملة.
es: Esto eliminará todos los archivos ZIP descargados.
ru: Это удалит все скачанные файлы ZIP.

# zipManagerExtractedZip
source: Extracted {zip}
ar: تم استخراج {zip}
es: {zip} extraído
ru: {zip} извлечено

# zipManagerDeleteExtractedZip
source: Deleted {zip}
ar: تم حذف {zip}
es: {zip} eliminado
ru: {zip} удалено

# zipManagerReExtractedZip
source: Re-Extracted {zip}
ar: تم إعادة استخراج {zip}
es: {zip} re-extraído
ru: {zip} переизвлечено

# readonlyModeName
source: Read-Only Mode
ar: وضع القراءة فقط
es: Modo sólo lectura
ru: Режим только чтение

# readonlyModeDescription
source: Prevent accidental edits to files
ar: يمنع التعديلات العرضية على الملفات
es: Evita ediciones accidentales en los archivos
ru: Защита от случайных изменений файлов

# syntaxHighlightingName
source: Syntax Highlighting
ar: تمييز الصيغة
es: Resaltado de sintaxis
ru: Подсветка синтаксиса

# syntaxHighlightingDescription
source: Colorful code syntax for better readability
ar: صيغة كود ملونة لتحسين قابلية القراءة
es: Colorea la sintaxis del código para una mejor legibilidad
ru: Цветное выделение кода для лучшей читаемости

# codeFoldingName
source: Code Folding
ar: طي الكود
es: Plegado de código
ru: Сворачивание кода

# codeFoldingDescription
source: Collapse and expand code blocks
ar: طي وتوسيع كتل الكود
es: Colapsa y expande bloques de código
ru: Скрытие и раскрытие блоков кода

# bracketMatchingName
source: Bracket Matching
ar: مطابقة الأقواس
es: Coincidencia de paréntesis
ru: Сопоставление скобок

# bracketMatchingDescription
source: Highlight matching brackets and parentheses
ar: تمييز الأقواس والأقواس المعقوفة المتطابقة
es: Resalta paréntesis y corchetes coincidentes
ru: Подсветка парных скобок и кавычек

# advancedEditorName
source: Advanced Options
ar: خيارات متقدمة
es: Opciones avanzadas
ru: Расширенные настройки

# advancedEditorDescription
source: Editor advanced options in Settings
ar: خيارات المحرر المتقدمة في الإعدادات
es: Opciones avanzadas del editor en Ajustes
ru: Расширенные параметры редактора в Настройках

# gitHistoryName
source: Git History
ar: سجل Git
es: Historial Git
ru: История Git

# gitHistoryDescription
source: View commit history and differences
ar: عرض سجل التسجيلات والاختلافات
es: Ver historial de commits y diferencias
ru: Просмотр истории коммитов и различий

# fileExplorerName
source: File Explorer
ar: مستكشف الملفات
es: Explorador de archivos
ru: Проводник

# fileExplorerDescription
source: Browse and manage project files
ar: تصفح وإدارة ملفات المشروع
es: Navega y gestiona archivos del proyecto
ru: Обзор и управление файлами проекта

# terminalName
source: Integrated Terminal
ar: طرفية مدمجة
es: Terminal integrado
ru: Встроенный терминал

# terminalDescription
source: Run commands without leaving the editor
ar: تشغيل الأوامر دون مغادرة المحرر
es: Ejecuta comandos sin salir del editor
ru: Запуск команд без выхода из редактора

# themeCustomizerName
source: Theme Customizer
ar: مخصص السمة
es: Personalizador de tema
ru: Настройка темы

# themeCustomizerDescription
source: Customize editor and app appearance
ar: تخصيص مظهر المحرر والتطبيق
es: Personaliza la apariencia del editor y la app
ru: Кастомизация внешнего вида редактора и приложения

# aiAssistName
source: AI Code Assistant
ar: مساعد الذكاء الاصطناعي للكود
es: Asistente de IA
ru: ИИ-помощник кода

# aiAssistDescription
source: Get AI-powered code suggestions
ar: احصل على اقتراحات كود مدعومة بالذكاء الاصطناعي
es: Obtén sugerencias de código impulsadas por IA
ru: Подсказки кода на основе искусственного интеллекта

# zipManagerTitle
source: ZIP Manager
es: Gestor de ZIP
ru: Менеджер ZIP
